public/programming/notes/algoritmi/09-probabilistic-algorithms.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../notes.html">Notes</a> &gt; <a href="algoritmi.html">Algoritmi</a> &gt;
</p>

<div id="outline-container-org7438be3" class="outline-2">
<h2 id="org7438be3">Probabilistic Algorithms</h2>
<div class="outline-text-2" id="text-org7438be3">
<p>
Negli algoritmi probabilistici, il calcolo delle probabilità e'
applicato non ai dati di input, ma ai dati di output.
</p>

<p>
In questo capitolo discuteremo algoritmi la cui correttezza e'
probabilistica (Montecarlo) e algoritmi corretti il cui tempo di
funzionamento e' probabilistico (Las Vegas).
</p>
</div>

<div id="outline-container-org3cfe2c0" class="outline-3">
<h3 id="org3cfe2c0">Algoritmi Montecarlo</h3>
<div class="outline-text-3" id="text-org3cfe2c0">
</div>
<div id="outline-container-orgc1a817e" class="outline-4">
<h4 id="orgc1a817e">Test di primalità</h4>
<div class="outline-text-4" id="text-orgc1a817e">
<p>
Vogliamo trovare un algoritmo per determinare se un numero in input
\(n\) e' primo. Una soluzione inefficiente testa tutti gli interi fra
\(2\) e \(\sqrt{n}\).
</p>

<pre class="example">
boolean isPrimeNaif(int n)
  for i=1 to sqrt(n) do
    if n/i == floor(n/i) then
      return false
  return true
</pre>

<p>
Per migliorare l'algoritmo possiamo ricordare il piccolo teorema di
Fermat che dimostra che se \(n\) e' primo, allora:
</p>

<p>
\[\forall b,2\le b < n:\ b^{n-1}mod\ n=1\]
</p>

<p>
Allora:
</p>

<pre class="example">
boolean isPrime1(int n)
  b = random(2, n-1)
  if b^{n-1} mod n != 1 then
    return false
  return true
</pre>

<p>
Tuttavia esistono dei numeri composti che non sono primi ma rispettano
la condizione. Infatti il piccolo teorema di Fermat non e' un se e
solo se: se il numero e' primo allora la condizione vale, ma non il
contrario. Dobbiamo sfruttare un altro risultato teorico per
migliorare l'algoritmo.
</p>

<p>
Miller-Rabin: Se \(n\) e' <b><b>primo</b></b>, allora per ogni intero \(b\), con
\(2\le b < n\) valgono entrambe le seguenti condizioni:
</p>

<ul class="org-ul">
<li>\(mcd(n, b)=1\)</li>
<li>\(b^m\ mod\ n = 1\lor \exists i, 0\le i < v:b^{m2^i}mod\ = n-1\)</li>
</ul>

<p>
con \(n-1=m2^v\), \(m\) dispari. 
</p>

<p>
Contrapposizione: Se esiste un intero \(b\) con \(w\le b < n\) tale che
almeno una delle seguenti condizione e' vera:
</p>

<ul class="org-ul">
<li>\(mcd(n, b)\neq 1\)</li>
<li>\(b^m\ mod\ n\ne 1 \land \forall i, 0\le i<v:b^{m2^i}mod\ n\neq n-1\)</li>
</ul>

<p>
allora \(n\) e' <b><b>composto</b></b>.
</p>

<pre class="example">
boolean isPrime(int n)
  for i =1 to k do
    b=random(2, n-1)
    if isComposize(n, b) then
      return false
  return true
</pre>

<p>
Complessità: \(O(klog^2(n)log(log(n))log(log(log(n))))\).  Rabin ha
dimostrato che se \(n\) e' composto allora ci sono almeno \((n-1)^{3/4}\)
testimoni in \([2, ..., n-1]\). Il test di compostezza ha una
probabilità inferiore a \(1/4\) di rispondere erroneamente.
</p>
</div>
</div>

<div id="outline-container-org6130718" class="outline-4">
<h4 id="org6130718">Espressione polinomiale nulla</h4>
<div class="outline-text-4" id="text-org6130718">
<p>
Data un'espressione algebrica polinomiale \(p(x_1, ..., x_n)\) in \(n\)
variabili, determinare se \(p\) e' identicamente nulla oppure no. Una
funzione polinomiale è identicamente nulla se è uguale a zero per ogni
valore della variabile indipendente, \(p(x)=0\ \forall x\in D\).
</p>

<p>
Algoritmo:
</p>

<ul class="org-ul">
<li>Si genera una $n$-pila di valori \(v_1, ..., v_n\)</li>
<li>Si calcola \(x=p(v1, ..., v_n)\)
<ul class="org-ul">
<li>Se \(x\neq 0\), \(p\) non e' identicamente nulla</li>
<li>Se \(x=0\), \(p\) potrebbe essere identicamente nulla</li>
</ul></li>
<li>Se ogni \(v_i\) e' un valore intero casuale compreso fra \(1\) e \(2d\)
dove \(d\) e' il grado del polinomio, allora la probabilita' di errore
non supera \(\frac{1}{2}\).</li>
<li>Si ripete \(k\) volte, riducente la probabilita' di errore a
\((\frac{1}{2})^k\).</li>
</ul>
</div>
</div>

<div id="outline-container-org92daad7" class="outline-4">
<h4 id="org92daad7">Strutture dati probabilistiche</h4>
<div class="outline-text-4" id="text-org92daad7">
<p>
Alcune strutture dati utili viste in precedenza sono:
</p>
<ul class="org-ul">
<li>Bit set: si usa un solo bit per oggetto ma bisogna avere una elenco
prefissato di oggetti</li>
<li>Tabelle hash: struttura dinamica ma alta occupazione di memoria</li>
</ul>

<p>
Introduciamo ora i <b><b>Bloom filters</b></b>, struttura dinamica con bassa
occupazione di memoria, ma elementi non possono essere cancellati e
non si ha memorizzazione con una risposta probabilistica.
</p>

<p>
Le funzioni che possiamo chiamare sono:
</p>

<ul class="org-ul">
<li>\(insert(key)\): Inserisce l'elemento \(key\) nel bloom filter</li>
<li>\(boolean\ contains(key)\): se restituisce <b><b>false</b></b> allora l'elemento
\(key\) e' sicuramente non presente nell'insieme. Se restituisce
<b><b>true</b></b> l'elemento \(key\) può essere presente oppure no (falsi
positivi).</li>
</ul>

<p>
Sia \(\epsilon\) la probabilità di falso positivo. I bloom filter
richiedono \(1.44log_2(\frac{1}{\epsilon})\) bit per elemento inserito.
</p>

<p>
Implementazione: si ha un vettore booleano \(A\) si \(m\) bit,
inizializzato a <b><b>false</b></b> e \(k\) funzioni hash \(h_1, h_2, ...,
h_k:U\rightarrow [0, m-1]\).
</p>

<pre class="example">
insert(key)
  for i=1 to k do
    A[h_i(key)]=true

boolean contains(key)
  for i=1 to k do
    if A[h_i(key)]==false then
      return false
  return true
</pre>

<p>
Qualche formula ora senza dimostrazione:
</p>

<ul class="org-ul">
<li>Dati \(n\) oggetti, \(m\) bit, \(k\) funzioni hash, la probabilità di un
falso positivo e' pari a \(\epsilon (1-e^{\frac{-kn}{m}})^k\)</li>
<li>Dati \(n\) oggetti e \(m\) bit, il valore ottimale per \(k\) e' pari a
\(k=\frac{m}{n}\ln2\)</li>
<li>Dati \(n\) oggetti e una probabilità di falsi positivi \(\epsilon\), il
numero di bit \(m\) richiesti e' pari a
\(m=-\frac{n\ln\epsilon}{(\ln2)^2}\)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org135dc4f" class="outline-3">
<h3 id="org135dc4f">Algoritmi Las Vegas</h3>
<div class="outline-text-3" id="text-org135dc4f">
<p>
Agli algoritmi statistici sui vettore estraggono alcune
caratteristiche statisticamente rilevanti da un vettore numerico, come
la media, la varianza o la moda.
</p>
</div>

<div id="outline-container-org486b035" class="outline-4">
<h4 id="org486b035">Problema della selezione</h4>
<div class="outline-text-4" id="text-org486b035">
<p>
Dato un array \(A\) contenente \(n\) valore e un valore \(1\le k \le n\),
trovare l'elemento che occuperebbe la posizione \(k\) se il vettore
fosse ordinato.
</p>

<p>
Da notare che il problema di trovare la mediana e' equivalente al
problema della selezione con \(k=\frac{n}{2}\)
</p>

<p>
Ovviamente possiamo ordinare il vettore e prendere il valore in
posizione \(k\), con costo \(O(nlogn)\). Per piccoli valori di \(k\) si
potrebbe invece create un heap e poppare il min finché non arriviamo
al $k$-appesimo min.
</p>

<p>
Un'approccio potrebbe essere utilizzare il quick sort assumendo che la
probabilità di scegliere un numero come pivot sia la stessa tra tutti
i numeri del vettore. A questo punto si può dimostrare che il tempo
medio e' \(O(n)\).
</p>

<pre class="example">
Item selection(Item[] A, int start, int end, int k)
  if start==end then
    return A[start]
  else
    int j = pivot(A, start, end)
    int q = j-start+1
    if k==q then
      return A[j]
    else if k &lt; q then
      return selection(A, start, j-1, k)
    else
      return selection(A, j+1, end, k-q)
</pre>

<hr />

<p>
Travel: <a href="algoritmi.html">Algoritmi</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
